# 大纲梗概
outline_synopsis = """
男主开始收集龙珠的原因是因为委托去寻找的。
但作为反派里线的原因是，为了在最终章集合世界权柄时，能方便的找到拥有大量权柄的神龙，而不需要临时再去找龙珠召唤神龙。
因此趁着委托，将龙珠找齐，并使用第二种方式召唤神龙，提前结束与神龙的契约，这样最终章时只需要找到神龙即可。
"""

# 大纲设定
outline_setting = """
在男主刚开始研究构术的时候，为了研究关于权柄的可行性，模仿七龙珠创造出了龙珠。
同时使用构术构造出了幻想中的神龙，将大量权柄整合至神龙身上，使神龙拥有了实现别人愿望的能力（构筑目标的能力）。
然后与神龙签订契约，劳动百年之后便可放其自由。
作为一个斯诺克爱好者，恶趣味地将七龙珠变为斯诺克彩球（黄、绿、咖啡、蓝、粉、黑和白球），模仿铁甲小宝的和平星，又做了15个只有少量权柄的假货（红球）。
龙珠本身是没有实现愿望的能力的，其内部本质是一个召唤构术，只有集齐七颗彩色龙珠后，才可召唤能许愿的神龙。
所有的22（7+15）颗龙珠都使用了构术将其变为透明金黄色，只有拿到手中确认获得者时，才会显露出原本的颜色。
召唤神龙的方式有两种，最简单的是集齐七颗彩色龙珠，便可实现愿望，但是一次只能实现一个简单的愿望。
这种方法在许完愿望之后，七颗龙珠会再次分散到世界各地。（问就是使用构术实现的效果）
第二种方式则是，在集齐七颗彩色龙珠的基础上，同时集齐剩余的15颗红色龙珠，将其放到台球桌上，按147分的顺序使其进洞（不需要一杆清）。
使用这种方式召唤的神龙，可以一次性实现三个强大的愿望，但是神龙也会因为契约内容，提前结束合同限制，获得自由，然后龙珠毁坏，再也无法召唤神龙许愿。
"""
