# 小说梗概
novel_synopsis = """
男主作为天才，意外发现了构成世界万物的基础力量，命名为世界之力，也可以是大家口中的信仰之力、生灵信念。
在深入研究的时候，发现世界上所有的生灵都或多或少的可以对这力量进行控制，只是没人意识到而已。
通过观测世界之力，发现了控制这些力量的能力，将其命名为世界权柄。
通过转移与整合权柄，最终男主发现了可以有效地具有逻辑地控制世界之力的方法，然后他将这些方法整理与简化，创造出了可以构建万物的方法，其名为构术。
"""

# 正文
text = """
“我愿用我十年单身，来换银魂永不完结！”
“？？我怀疑你在骗对象。说吧，现在银魂完结了，你是不是找到女朋友了？”
“那就只要我男神（指着坂田银时的图片）一日不结婚，我就一日不谈爱！”
“？？？人家都完结了还能结个尖儿的婚啊！别给自己找不到对象找借口啊kora！！！”
这是一个单纯的粉丝因为无法接受空知英秋老师的《银魂》完结了而试图模仿万事屋的故事，如有雷同，不是巧合。
本小说由，米其轮和猩人头不独家也没赞助但还是播出。
"""

# 主干大纲顺序
main_outline_sequence = ["许愿七龙珠", "学院世界杯", "幻想兽大陆", "系统者纷争", "权柄保卫战"]
