# 大纲梗概
outline_synopsis = """
从许愿龙珠中结束契约获得自由的神龙，使用自己的许愿能力，在遥远的海边构造出了一片岛屿，与各种各样传说中的幻想兽。
在从获得自由后的一段时间后，岛屿上的幻想兽们迅速发展并趋于稳定，并决定与外界建交。
在这个前提下，世界各国决定组建一支外交队伍前往进行交流。
但是因为幻想兽是由神龙的能力刚创造出来没几年的生物，为了便于交流，世界各国决定在这个队伍中加入一些新的年轻成员。
于是应运而生，今年的世界杯便是一个最好的筛选场地，决定给予本届世界杯的冠军队伍与各个表现优秀的学员这个机会。
为了满足强大且年轻并且成年这个条件，当然主要名额还是倾向于大学生，与少量表现优异的高中生。
因为前往交流，就有机会与幻想兽构筑羁绊，使其成为自己的伙伴，因此各大学院都在明争暗斗地招募外援，请回已经在外实习闯荡的有名大学生。
使得这届世界杯极为激烈，且备受世界关注。

而男主作为挂名大学生，被高额佣金的委托召唤回校，参加这次学院世界杯。
因为学院有名，不需要从地区开始进行海选，只需要作为省种子参与最终四强的省决赛。
然后以省冠军的身份，参与全国大赛（32支队伍）。
最终全国前三队伍得以参加世界杯大赛，与世界各地共计256支队伍进行大赛。
每个大国有三个名额，一些小国根据能力拥有两个或一个名额，各大有名势力在交了巨额参赛费与实力考核后可以拥有最多一个名额进行参赛。
男主在不出手的情况下作为省冠军，然后在全国大赛准决赛中作为大魔王统治全国，最终以无敌之势带领学院成为世界冠军。
作为反派离线，男主本质是需要去幻想兽大陆而不引起太大注意的，因此就算没有委托，也会找一个势力作为外援参赛。
为了保证可以前往幻想兽大陆，男主还是无惊无险的带领队伍成为世界冠军队。
因为正常流程即可前往幻想兽大陆，因此本章节没有反派线。
"""
