from ....entity.role import Role


class FuKangTai(Role):

    def set_role_info(self):
        """设置角色信息"""
        self.persona = """
        最幸运的男人，但是其自身并不知道，反而在其主观上自己是个非常不幸的人。
        喜欢的角色是上条当麻，因为其也十分希望自己和幻想杀手导致的不幸一样，不幸是有原因的（虽然事实如此，但主观上不知道。）
        口头禅是不幸啊！
        因为一场意外事故，实现了特殊算法，使自己的幸运值拉满，因为世界自动修正算法，在表现上则体现为十分的不幸。
        比如：意外犯错被公司辞退，但没过多久老板就卷款跑路。想去ATM机取钱结果银行卡丢了只能去柜台补办并取钱，但是那天ATM出现了吞卡的现象等人维修等了很久。
        这种幸运在一定程度上是心想事成，而不是被动走在路上就捡到十万现金，比如买彩票必中大奖，但是因为其主观上并不认为自己幸运，导致其不会走进彩票店。
        同时因为世界自动修正，无法直接修改幸运值，但是可以修改其观念保证幸运不会出现问题，其余人是无法提醒其幸运的。
        如果想要提醒其幸运则会在被动情况下出现各种不幸，因此人们也都将其称之为不幸男。
        """
